app/controllers/incidents_controller.rb

  def edit
    @incident = Incident.find(params[:id])
---
SELECT * FROM "incidents" WHERE ("incidents"."id" = 1)

  def create
    @incident = Incident.new(params[:incident])

    respond_to do |format|
      if @incident.save
---
INSERT INTO "incidents" ("latitude", "created_at", "title", "updated_at", "longitude", "when", "description", "montain") VALUES(1000.0, '2010-10-05 19:55:08', 'Monte Everest', '2010-10-05 19:55:08', 2000.0, '2010-10-05 19:54:00', 'A montanha mais alta do mundo', 'Everest')

  def update
    @incident = Incident.find(params[:id])

    respond_to do |format|
      if @incident.update_attributes(params[:incident])
---
SELECT * FROM "incidents" WHERE ("incidents"."id" = 1)
UPDATE "incidents" SET "updated_at" = '2010-10-10 18:41:52', "longitude" = 5110.0, "latitude" = 2318.0, "title" = 'Londrina', "montain" = 'Pico Londrina', "description" = 'Pequena Londres' WHERE "id" = 1

  def show
    @incident = Incident.find(params[:id])
---
SELECT * FROM "incidents" WHERE ("incidents"."id" = 1)

  def news
    @incidents=Incident.find(:all,:conditions=>['updated_at > ?',Time.now.yesterday])
---
SELECT * FROM "incidents" WHERE (updated_at > '2010-10-09 16:50:15')